МитапEDT/src/DataProcessors/НебезопасноеУдалениеИзКоллекции/НебезопасноеУдалениеИзКоллекции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>НебезопасноеУдалениеИзКоллекции</name>
</mdclass:DataProcessor>

МитапEDT/src/InformationRegisters/fs_ИсторияЗаменыФлагаDiscontinued/fs_ИсторияЗаменыФлагаDiscontinued.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>fs_ИсторияЗаменыФлагаDiscontinued</name>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

МитапEDT/src/Enums/ЗначенияРеквизитаОкончанияПроизводства/ЗначенияРеквизитаОкончанияПроизводства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЗначенияРеквизитаОкончанияПроизводства</name>
  <enumValues>
    <name>z03</name>
  </enumValues>
  <enumValues>
    <name>z04</name>
  </enumValues>
</mdclass:Enum>

МитапEDT/src/DataProcessors/НебезопасноеУдалениеИзКоллекции/ObjectModule.bsl
//////////////////////////////////////////////////////////
// Примеры только из реальных проектов. Только хардкор
//////////////////////////////////////////////////////////

Процедура ПроверкаРеквизитаDiscontinuedНоменклатуры() Экспорт
	
	 Запрос = Новый Запрос;
	 Запрос.Текст = "ВЫБРАТЬ
	 |	ТоварыНаСкладахОстатки.Номенклатура,
	 |	ТоварыНаСкладахОстатки.Характеристика,
	 |	ТоварыНаСкладахОстатки.Склад,
	 |	ТоварыНаСкладахОстатки.Помещение,
	 |	ТоварыНаСкладахОстатки.Серия,
	 |	ТоварыНаСкладахОстатки.ВНаличииОстаток,
	 |	ТоварыНаСкладахОстатки.ВРезервеОстаток
	 |ИЗ
	 |	РегистрНакопления.ТоварыНаСкладах.Остатки(
	 |			&Дата1,
	 |			Склад В (&СпСкладов)
	 |				И Номенклатура.Discontinued = &Z04) КАК ТоварыНаСкладахОстатки";
	 
	 СпСкладов = Новый Массив;
	 СпСкладов.Добавить(Константы.СкладОсновной.Получить());
	 СпСкладов.Добавить(Константы.СкладРезерва.Получить());
	 
	 Запрос.УстановитьПараметр("Z04", Перечисления.ЗначенияРеквизитаОкончанияПроизводства.z04);
	 Запрос.УстановитьПараметр("Дата1", ТекущаяДата());
     Запрос.УстановитьПараметр("СпСкладов", СпСкладов);
     	 
	 
	 Результат = Запрос.Выполнить();
	 Выборка = Результат.Выбрать();
	 
	 ФС = Новый ЗаписьТекста("D:\Ant\" + "CHANGE_Z04_Z03__" + СтрЗаменить(Строка(ТекущаяДата()), ":", "-") + ".txt");
	 
	 Пока Выборка.Следующий() Цикл
	 
	 	 НоменклатураОбъект = Выборка.Номенклатура.ПолучитьОбъект();
		 
		 НоменклатураОбъект.Discontinued = Перечисления.ЗначенияРеквизитаОкончанияПроизводства.z03;
		 НоменклатураОбъект.Записать();
		 
		 Запись = РегистрыСведений.fs_ИсторияЗаменыФлагаDiscontinued.СоздатьМенеджерЗаписи();
		 
		 Запись.Активность = Истина;
		 Запись.Номенклатура = Выборка.Номенклатура;
		 Запись.Записать();
		 
		 ФС.ЗаписатьСтроку("z04 -> z03  В номенклатуре " + Выборка.Номенклатура + " (код " + Выборка.Номенклатура.Код + "  артикул " + Выборка.Номенклатура.Артикул + ") произведена замена реквизита Disciuntinued - вместо z04 установлен z03");
         		 
	 КонецЦикла;
	 
	 
	 Запрос1 = Новый Запрос;
	 Запрос1.Текст = "ВЫБРАТЬ
	 |	Ном03.Номенклатура,
	 |	Остатки.ВНаличииОстаток
	 |ИЗ
	 |	(ВЫБРАТЬ
	 |		fs_ИсторияЗаменыФлагаDiscontinued.Номенклатура КАК Номенклатура
	 |	ИЗ
	 |		РегистрСведений.fs_ИсторияЗаменыФлагаDiscontinued КАК fs_ИсторияЗаменыФлагаDiscontinued) КАК Ном03
	 |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	 |			ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
	 |			ТоварыНаСкладахОстатки.ВНаличииОстаток КАК ВНаличииОстаток
	 |		ИЗ
	 |			РегистрНакопления.ТоварыНаСкладах.Остатки(&Дата1, Склад В (&СпСкладов)) КАК ТоварыНаСкладахОстатки) КАК Остатки
	 |		ПО Ном03.Номенклатура = Остатки.Номенклатура
	 |ГДЕ
	 |	ЕСТЬNULL(Остатки.ВНаличииОстаток, 0) = 0";
	 
	 Запрос1.УстановитьПараметр("Дата1", ТекущаяДата());
	 Запрос1.УстановитьПараметр("СпСкладов", СпСкладов);
	 
	 Результат1 = Запрос1.Выполнить();
	 Выборка1 = Результат1.Выбрать();
	 
	 ФС.ЗаписатьСтроку("");
         
	 
	 Пока Выборка1.Следующий() Цикл
		 
		 НоменклатураОбъект = Выборка1.Номенклатура.ПолучитьОбъект();
		 
		 НоменклатураОбъект.Discontinued = Перечисления.ЗначенияРеквизитаОкончанияПроизводства.z04;
		 НоменклатураОбъект.Записать();
		 
		 Записи = РегистрыСведений.fs_ИсторияЗаменыФлагаDiscontinued.СоздатьНаборЗаписей();
		 Записи.Отбор.Номенклатура.Установить(Выборка1.Номенклатура);
		 Записи.Прочитать();
		 
		 Для Каждого Запись Из Записи Цикл
			 Записи.Удалить(Запись);
		 КонецЦикла;
		 
		 Записи.Записать();
		 
		 ФС.ЗаписатьСтроку("z03 -> z04  В номенклатуре " + Выборка.Номенклатура + " (код " + Выборка.Номенклатура.Код + "  артикул " + Выборка.Номенклатура.Артикул + ") произведена замена реквизита Disciuntinued - вместо z03 установлен z04");
         		 
	 КонецЦикла;
	  	 
	 ФС.Закрыть();
	 
КонецПроцедуры
